app/controllers/users_controller.rb

	def index
		fields = [:user_id, :user_name, :user_email]

		if params[:incluir_login]
			fields.push(:user_login)
		end

		@user = User.all
---
SELECT [users].* FROM [users]